{
	"introduction": {
		"beforeName": "Wraz z grupą aspirujących informatyków dzięki samorządowi wydziału matematyki stosowanej jesteś na rajdzie w Karkonoszach. W trakcie wędrówki przez las drugiego dnia wycieczki zauważasz między drzewami fragmenty podupadłej, kamiennej budowli. Przecierasz oczy ze zdumienia i zastanawiasz się, czy to aby nie wytwór Twojej wyobraźni wywołany niewyspaniem. W przypływie chęci zaznania przygody życia postanawiasz odłączyć się od grupy i zbadać podejrzany obiekt na własną rękę. Znajdujesz zarośnięte mchem drzwi, które ku Twojemu zdziwieniu dają się otworzyć. Twoim oczom ukazują się długie schody prowadzące w dół – w ciemną, mroczną otchłań. \"Co może pójść nie tak\" – myślisz i pogwizdując z zadowoleniem do melodii z Indiany Jonesa zaczynasz schodzić. Docierasz do pomieszczenia, do którego prowadziły schody.Jest niewielkie, lecz starannie wykończone, zauważasz niewyraźne płaskorzeźby i kamienną posadzkę.Byłoby całkiem ciemno, gdyby nie światło świec na ścianach wpadające przez trzy kamienne łuki drzwiowe – jeden naprzeciw Ciebie i dwa po bokach. Ciszę gwałtownie przerywa dobiegający z bliżej nieokreślonej przestrzeni aksamitny głos polskiego lektora Macieja Gudowskiego oznajmiający, że musisz podać imię ponieważ jesteś teraz głównym bohaterem gry Ultra Dungeon Maze Stroll. Uznajesz, że na rajdzie matematyków nic Cię już nie zdziwi i podajesz bez wahania.",
		"afterName": "Za Twoimi plecami rozlega się metaliczny dźwięk klucza przekręcanego w drzwiach. Już wiesz, że nie możesz wyjść stąd tą samą drogą. Pozostaje pytanie, czy w ogóle możesz stąd wyjść? \n\nWybierasz kierunek podróży przy pomocy n - północ, s - południe, w - zachód, e - wschód, q - wyjście z gry \n(Naciśnij enter aby kontynuować)"
    },
    "room_data": {
        "COMMON": {
            "not_visited": "\b",
            "visited": " "
        },
        "ENTRANCE": {
            "not_visited": "\b",
            "visited": "\nHmmmm tutaj zacząłem..."
        },
        "WITH_DOOR_KEY": {
            "not_visited": "\nWchodzisz do pomieszczenia które sprawia wrażenie innego niż pozostałe. Z nieznanego Ci powodu jest tutaj bardzo ciemno i zimno. Jedynym źródłem światła jest coś małego znajdującego się na samym środku pomieszczenia. Nie mając nic lepszego do roboty kierujesz się w stronę podejrzanego źródła światła. Z każdym krokiem poziom Twojej ekscytacji wzrasta. W końcu podchodzisz wystarczająco blisko, znajdujesz się już w blasku światła. Zdezorientowany szukasz jego źródła. Nagle, w Twoich uszach zaczyna dzwonić\n\"Czeeeeść\". Zamierasz ze strachu, do tej pory myślałeś że znajdujesz się tutaj sam, nie przeszło Ci przez głowę że mogą znajdować się tutaj jakieś potwory lub, co gorsza, inni ludzie. Rozglądasz się w poszukiwaniu źródła dźwięku. Głos odzywa się ponownie \"tutaj, na dole\". Spoglądasz w dół i widzisz małego niebieskiego grzyba. \"Czekaj, co?\" Przez chwilę zastanawiasz się czy na pewno wziąłeś swoje leki rano, myśl ta szybko wylatuje Ci z głowy kiedymały grzybek odzywa się ponownie.\n\"Jeśli chcesz stąd wyjść to musisz rozwiązać moją zagadkę!\"\n\"To najgłupsza rzecz jaką w życiu usłyszałem\" - idiotyzm całej sytuacji jest uderzający. W tym samym czasie grzybek wyciągnął złoty, połyskujący klucz i zaczął Ci nim machać przed nosem. \"To wygląda konkretnie\" - z tą myślą postanowiłeś zgodzić się na warunki grzybka\n\"Pies bernardyn biegnie z prędkością 10 km/h i niesie pudełko 10 płytek DVD o pojemności 4,7 GB każda. Czy będzie on przesyłał dane szybciej niż sieć Fast Ethernet (100 Mb/s) na odcinku 8 km?\" Nie dowierzasz swoim uszom, właśnie pobity został Twój ustanowiony przed chwilą rekord na najgłupszą rzecz jaką w życiu usłyszałeś. Grzyb musiał mieć nie lada talent że był w stanie tak szybko pobić tak ciężkie rekordy. Z rozmyślań wyciągnął Cie głos uroczej istotki oznajmiający że Twój czas się skończył i chyba będziesz musiał tutaj zostać z nim już na zawszę. \"?????????????????????????????????????\" Już miałeś panikować ale przypomniało Ci się że zostawiłeś swój ostateczny, finalny ruch właśnie na taką okazję. Wziąłeś głęboki wdech, skupiłeś się, zebrałeś wszystkie swoje siły. Jednym sprawnym ruchem wyrywasz klucz z rączki małego grzybka i jak najszybciej uciekasz krzycząc \"NIGERUNDAYO\" jak Twoja ulubiona postać z anime.",
            "visited": "\nPonownie wchodzisz do ciemnego pomieszczenia. Na środku stoi świecący, niebieski grzybek. Blask który z niego bije wydaje się być słabszy niż ostatnim razem. Słyszysz bardzo ciche szlochanie. \"Chyba to co zrobiłem nie spodobało się biednemu grzybkowi, z drugiej strony chciał mnie tu zamknąć na zawsze\" - pomyślałeś\nTy potworze..."
        },
        "EXIT": {
            "not_visited": "\nWpadasz ze zniecierpliwieniem do kolejnego pomieszczenia. Nie znajdujesz w nim nic oprócz jakichś ogromnych, zdobionych drzwi z napisem \"WYJŚCIE\". Zaraz… Nareszcie! Biegniesz do nich, ciągniesz za żeliwną klamkę i nic się nie dzieje. No tak, pewnie trzeba pchać. Dalej nic… Wygląda na to, że musisz się tu jeszcze rozejrzeć.",
            "visited": "\nWchodzisz do pomieszczenia z ogromnymi drzwiami po raz kolejny. Znowu próbujesz je otworzyć, może poprzednim razem po prostu się zacięły, a może Ty nie miałeś dostatecznie dużo siły. Robisz na podłodze pięć pompek i ciągniesz za klamkę. Wciąż nic. To chyba nie ma sensu."
        },
        "PORTAL1": {
            "not_visited": "\nPierwszym co rzuca Ci się w oczy po wejściu do pomieszczenia jest stojąca w jego centralnej części wielka, okrągła, kamienna rama. Bardzo odstaje od reszty wystroju i czujesz, że nie może to być jedynie zwykła ozdoba. Oprócz dziwnego przedmiotu w pomieszczeniu znajdują się dwa wyjścia - południowe i zachodnie.",
            "visited": "\nTrafiasz do pokoju ze znaną Ci już wielką kamienną ramą.",
            "portal_opened": {
                "not_visited": "\nTym razem rama, która już wcześniej wyraźnie się wyróżniała, teraz sprawia wrażenie, jakby była wypełniona barwną, żarzącą się substancją. “Może to designerski rodzaj lustra?” myślisz i postanawiasz się w nim przejrzeć. Ciekawość aż zanadto popycha Cię do działania bo po drodze potykasz się i wpadasz na domniemane lustro, a właściwie przelatujesz przez nie.",
                "visited": "\nTym razem jesteś jednak ostrożniejszy w stosunku do portalu i rozważasz czy aby na pewno chcesz z niego jeszcze kiedykolwiek korzystać. Przybierasz poważny wyraz twarzy Geralta z Rivii mówiąc z niesmakiem \"Nienawidzę portali…\"."
            }
        },
        "PORTAL2": {
            "not_visited": "\nPierwsza rzecz, którą czujesz, to zimna, kamienna posadzka. Na Twojej twarzy. Gratulujesz sobie nowego osiągnięcia, bo pierwszy raz wyrżnąłeś na tyle konkretnie, że wylądowałeś w innym pomieszczeniu. Zbierając zęby z podłogi porządkujesz w głowie fakty na temat tego co się właśnie stało. Uświadamiasz sobie, że dziwne lustro okazało się być magicznym portalem. Po wyjściu z szoku rozglądasz się dookoła. Widzisz dwa korytarze, z jednego, prowadzącego na północ sączy się delikatne światło, drugi natomiast, prowadzący na wschód, jest kompletnie ciemny i wygląda trochę groźnie.",
            "visited": "\nWracasz do pomieszczenia z portalem. Możesz z niego skorzystać lub udać się w kierunku północnym albo wchodnim."
        },
        "WITH_PORTAL_KEY": {
            "not_visited": "\nDostajesz się do bardzo specyficznego pomieszczenia. Na każdej ścianie znajdują się kolorowe, mieniące się kamienie. Jako, że masz w nawyku dokładnie badać nowe rzeczy zaczynasz dotykać ścian i odkrywasz, że niektóre z kamieni da się wcisnąć. Zaczynasz więc chodzić dookoła pokoju i klikać w te kamienie, które akurat wpadną Ci w oko, bo i tak nie masz nic lepszego do roboty w tej plątaninie korytarzy. Przy wciśnięciu któregoś kamienia rozlega się donośny głos narratora oznajmiający, że sekwencja jest prawidłowa i połączenie zostało otwarte. \"Ale jakie niby połączenie, autobusy tu mają czy co? Przecież nic się tutaj nie otworzyło!\". Chyba pora wyjść z tego dziwnego pokoju.",
            "visited": "\nZnowu trafiasz do pomieszczenia z kolorowymi mieniącymi się kamieniami. Tym razem unikasz kontaktu fizycznego z obawy że zerwiesz połączenie autobusowe i ktoś spóźni się do pracy."
        }
    },
    "victory": "\nCzekaj chwilę... Głos w Twojej głowie który przeważnie starasz się ignorować bardzo usilnie chce Ci coś powiedzieć. Wyciszasz się żeby się w niego wsłuchać. \"KLUCZ, MASZ KLUCZ!\"\n... \"NO TAK, MAM KLUCZ! Jestem genialny\" - myślisz sobie zadowolony ze swojego osiągnięcia podczas gdy cichnący już głos w głowie narzeka że znowu przypisujesz sobie jego zasługi. Wkładasz klucz do zamka, słyszysz klik, pasuje! Przekręcasz go prędko i wielkie drzwi zaczynają się otwierać. Świeże powietrze i oślepiające światło uderzają Cię jak wielki młotek. A nie, czekaj, co? Budzisz się w na ziemi otoczony przez swoich najbliższych informatyków. Czujesz pulsujący ból głowy, nie masz pojęcia co się dzieje. Twój przyjaciel Dominik (pseudonim słoń) tłumaczy Ci że podczas waszej imprezy spadł Ci na głowę młotek i byłeś nieprzytomny przez pół godziny. Jesteś szczęśliwy że Twoja głowa jest tak odporna na młotki. Wracając na imprezę jedna myśl nie daje Ci spokoju…\n\"Dlaczego nadal słyszę głos tego durnego narratora?\""
}